<?php


/* @var $this yii\web\View */

use yii\helpers\Html;

$this->title = '关于';
?>
<div class="site-about">
    <h3>我们的心路历程</h3>

    <p>我们平时做大作业时有时需要去汲取csdn、博客园等网站查看他人分享的代码里的思想，基于这些IT交流分享平台，想把涉及范围扩大一些，不仅止于代码，还加上一些更贴切生活的东西，比如说音乐、美食、文章、诗词等等……
于是这次大作业团队主页就实现了一个以“分享”为主题的网页。
所有已登录用户可以在网页的任意一个主题下分享内容，也可以查看其他用户分享的内容。
除此之外，用户可以给网页留言，并即时显示出来。</p>

<p>本来想把功能实现的更齐全一些，比如说用户之间的关注和拉黑、用户对每一篇分享的评论以及回复、用户之间的私信、用户给文章赞或踩并统计每一篇文章的赞或踩总数目……
经过了好几天的尝试后，由于对yii框架底层与数据库的交互了解甚少，发现后台的逻辑交互实在是难以实现，而且眼看着截止时间越来越近，于是放弃了这些功能，专心做了分享的功能。
交上去的这个大作业实现了我们预想的初步功能，但受目前能力和截止时间的限制，许多略复杂的功能都没有实现。作业虽然这样交上去了，但我们对网页功能实现的探索还没有结束。今后会更加深层次地学习互联网和数据库的相关知识，争取早日实现上述较复杂的功能，完成最初更大的目标。
</p>

</div>
